using Tyuiu.SologubNV.Sprint2.Task2.V2.Lib;
using static System.Console;
class Program
{
    static void Main(string[] args)
    {
        DataService ds = new DataService();
        Title = "Спринт #2 | Выполнил: Сологуб Н.В | ИБКСб-26-1";
        WriteLine("***************************************************************************");
        WriteLine("* Спринт #2                                                               *");
        WriteLine("* Тема: Создание Итогового решения по спринту                             *");
        WriteLine("* Задание #2                                                              *");
        WriteLine("* Вариант #2                                                              *");
        WriteLine("* Выполнил: Сологуб Николай Витальевич | ИБКСб-26-1                       *");
        WriteLine("***************************************************************************");
        WriteLine("* УСЛОВИЕ;                                                                *");
        WriteLine("* Написать программу на, которая запрашивает целые значения с клавиатуры и*");
        WriteLine("* вычисляет находится ли точка с координатами X,Y в заштрихованной области*");
        WriteLine("***************************************************************************");
        WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                         ");
        WriteLine("***************************************************************************");
        WriteLine("Введите значение переменной X: ");
        int x = Convert.ToInt32(ReadLine());
        WriteLine("Введите значение переменной Y: ");
        int y = Convert.ToInt32(ReadLine());
        bool res = ds.CheckDotInShadedArea(x, y);


        WriteLine("***************************************************************************");
        WriteLine("* РЕЗУЛЬТАТ                                                               *");
        WriteLine("***************************************************************************");
        if (res) WriteLine("Точка находится в заштрихованной области");
        else WriteLine("Точка находится не в заштрихованной области");
        ReadLine();
    }
}