using Tyuiu.SologubNV.Sprint2.Task5.V14.Lib;
using static System.Console;
class Program
{
    static void Main(string[] args)
    {
        DataService ds = new DataService();
        Title = "Спринт #2 | Выполнил: Сологуб Н.В | ИБКСб-26-1";
        WriteLine("***************************************************************************");
        WriteLine("* Спринт #2                                                               *");
        WriteLine("* Тема: Создание Итогового решения по спринту                             *");
        WriteLine("* Задание #5                                                              *");
        WriteLine("* Вариант #14                                                             *");
        WriteLine("* Выполнил: Сологуб Николай Витальевич | ИБКСб-26-1                       *");
        WriteLine("***************************************************************************");
        WriteLine("* УСЛОВИЕ;                                                                *");
        WriteLine("* Условие: Дано целое число k (1 <= k <= 365). Определить, каким днем     *");
        WriteLine("* недели (понедельником, вторником, …, субботой или воскресеньем)         *");
        WriteLine("* является k-й день не високосного года, в котором 1 января d-й день      *");
        WriteLine("* недели (если 1 января — понедельник, то d = 1 , если вторник — d = 2    *");
        WriteLine("* , …, если воскресенье — d = 7).                                         *");
        WriteLine("***************************************************************************");
        WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                         ");
        WriteLine("***************************************************************************");
        WriteLine("Введите значение переменной k: ");
        int x = Convert.ToInt32(ReadLine());
        WriteLine("Введите значение переменной d: ");
        int y = Convert.ToInt32(ReadLine());
        string res = ds.FindDayName(x, y);


        WriteLine("***************************************************************************");
        WriteLine("* РЕЗУЛЬТАТ                                                               *");
        WriteLine("***************************************************************************");
        WriteLine("День Недели = " + res);
        ReadLine();
    }
}