using Tyuiu.SologubNV.Sprint2.Task7.V13.Lib;
using static System.Console;
class Program
{
    static void Main(string[] args)
    {
        DataService ds = new DataService();
        Title = "Спринт #2 | Выполнил: Сологуб Н.В | ИБКСб-26-1";
        WriteLine("***************************************************************************");
        WriteLine("* Спринт #2                                                               *");
        WriteLine("* Тема: Создание Итогового решения по спринту                             *");
        WriteLine("* Задание #7                                                              *");
        WriteLine("* Вариант #13                                                             *");
        WriteLine("* Выполнил: Сологуб Николай Витальевич | ИБКСб-26-1                       *");
        WriteLine("***************************************************************************");
        WriteLine("* УСЛОВИЕ;                                                                *");
        WriteLine("* Написать программу на C#, которая запрашивает исходные данные           *");
        WriteLine("* (вещественные значения) и вычисляет, находится ли точка с координатами  *");
        WriteLine("* X,Y в заштрихованной области.  y<=1;y>=x-1;x^2+y^2<=1                   *");
        WriteLine("***************************************************************************");
        WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                         ");
        WriteLine("***************************************************************************");
        WriteLine("Введите значение переменной x: ");
        double x = Convert.ToDouble(ReadLine());
        WriteLine("Введите значение переменной y: ");
        double y = Convert.ToDouble(ReadLine());
        WriteLine("***************************************************************************");
        WriteLine("* РЕЗУЛЬТАТ                                                               *");
        WriteLine("***************************************************************************");
        WriteLine(ds.CheckDotInShadedArea(x,y));
        ReadLine();
    }
}