using Tyuiu.SologubNV.Sprint2.Task4.V3.Lib;
using static System.Console;
class Program
{
    static void Main(string[] args)
    {
        DataService ds = new DataService();
        Title = "Спринт #2 | Выполнил: Сологуб Н.В | ИБКСб-26-1";
        WriteLine("***************************************************************************");
        WriteLine("* Спринт #2                                                               *");
        WriteLine("* Тема: Создание Итогового решения по спринту                             *");
        WriteLine("* Задание #4                                                              *");
        WriteLine("* Вариант #3                                                              *");
        WriteLine("* Выполнил: Сологуб Николай Витальевич | ИБКСб-26-1                       *");
        WriteLine("***************************************************************************");
        WriteLine("* УСЛОВИЕ;                                                                *");
        WriteLine("* Написать программу, которая вычисляет требуемое значение с              *");
        WriteLine("* использованием тернарного оператора, где пользователь вводит            *");
        WriteLine("* значение переменной x,y с клавиатуры, если x<y-1,то    y-1         (1  )*");
        WriteLine("*                                                 z =y + ---иначеx+2y(-- )*");
        WriteLine("*                                                        x+2         (y+3)*");
        WriteLine("* Округлить полученное значение до трех знаков после запятой;             *");
        WriteLine("***************************************************************************");
        WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                         ");
        WriteLine("***************************************************************************");
        WriteLine("Введите значение переменной x: ");
        double x = Convert.ToDouble(ReadLine());
        WriteLine("Введите значение переменной y: ");
        double y = Convert.ToDouble(ReadLine());
        double res = ds.Calculate(x,y);


        WriteLine("***************************************************************************");
        WriteLine("* РЕЗУЛЬТАТ                                                               *");
        WriteLine("***************************************************************************");
        WriteLine("Значение функции = " + res);
        ReadLine();
    }
}