using Tyuiu.SologubNV.Sprint2.Task0.V9.Lib;
using static System.Console;
class Program
{
    static void Main(string[] args)
    {
        DataService ds = new DataService();
        Title = "Спринт #2 | Выполнил: Сологуб Н.В | ИБКСб-26-1";
        WriteLine("***************************************************************************");
        WriteLine("* Спринт #2                                                               *");
        WriteLine("* Тема: Создание Итогового решения по спринту                             *");
        WriteLine("* Задание #0                                                              *");
        WriteLine("* Вариант #9                                                              *");
        WriteLine("* Выполнил: Сологуб Николай Витальевич | ИБКСб-26-1                       *");
        WriteLine("***************************************************************************");
        WriteLine("* УСЛОВИЕ;                                                                *");
        WriteLine("* Написать программу из операций сравнений (==, !=, <, >, <=, >=,         *");
        WriteLine("* последовательность операций не должна нарушаться) и арифметических      *");
        WriteLine("* выражений, которая вернет логическую последовательность(массив):        *");
        WriteLine("*(True, True, True, True, True, False), при x = 1054, y = 375             *");
        WriteLine("***************************************************************************");
        WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                         ");
        WriteLine("***************************************************************************");
        int x, y;
        x = 1054;
        y = 375;
        bool[] res = new bool[6];
        res = ds.GetCompareOperations(x, y);
        

        WriteLine("***************************************************************************");
        WriteLine("* РЕЗУЛЬТАТ                                                               *");
        WriteLine("***************************************************************************");
        for (int i = 0; i < 6; i++)
        {
            WriteLine(res[i]);
        }
        ReadLine();
    }
}