using Tyuiu.SologubNV.Sprint2.Task1.V20.Lib;
using static System.Console;
class Program
{
    static void Main(string[] args)
    {
        DataService ds = new DataService();
        Title = "Спринт #2 | Выполнил: Сологуб Н.В | ИБКСб-26-1";
        WriteLine("***************************************************************************");
        WriteLine("* Спринт #2                                                               *");
        WriteLine("* Тема: Создание Итогового решения по спринту                             *");
        WriteLine("* Задание #1                                                              *");
        WriteLine("* Вариант #20                                                              *");
        WriteLine("* Выполнил: Сологуб Николай Витальевич | ИБКСб-26-1                       *");
        WriteLine("***************************************************************************");
        WriteLine("* УСЛОВИЕ;                                                                *");
        WriteLine("* Написать программу из операций сравнений (==, !=, <, >, <=, >=,         *");
        WriteLine("* последовательность можно чередовать, но использовать один раз в         *");
        WriteLine("* выражении) и логических операций (|, &, ||, &&, !, ^, последовательность*");
        WriteLine("* операций не должна нарушаться), а также арифметических выражений,       *");
        WriteLine("* которая вернет логическую последовательность(массив):                   *");
        WriteLine("* (False, False, False, True, True, True), при a=242, b=155, c=456, d=17  *");
        WriteLine("***************************************************************************");
        WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                         ");
        WriteLine("***************************************************************************");
        int a,b,c,d;
        a = 242;
        b = 155;
        c = 456;
        d = 17;

        bool[] res = new bool[6];
        res = ds.GetLogicOperations(a,b,c,d);


        WriteLine("***************************************************************************");
        WriteLine("* РЕЗУЛЬТАТ                                                               *");
        WriteLine("***************************************************************************");
        for (int i = 0; i < 6; i++)
        {
            WriteLine(res[i]);
        }
        ReadLine();
    }
}