using Tyuiu.SologubNV.Sprint2.Task6.V13.Lib;
using static System.Console;
class Program
{
    static void Main(string[] args)
    {
        DataService ds = new DataService();
        Title = "Спринт #2 | Выполнил: Сологуб Н.В | ИБКСб-26-1";
        WriteLine("***************************************************************************");
        WriteLine("* Спринт #2                                                               *");
        WriteLine("* Тема: Создание Итогового решения по спринту                             *");
        WriteLine("* Задание #6                                                              *");
        WriteLine("* Вариант #13                                                             *");
        WriteLine("* Выполнил: Сологуб Николай Витальевич | ИБКСб-26-1                       *");
        WriteLine("***************************************************************************");
        WriteLine("* УСЛОВИЕ;                                                                *");
        WriteLine("* Условие: Дата некоторого дня характеризуется тремя натуральными         *");
        WriteLine("* числами: g (год), m (порядковый номер месяца) и n (число).              *");
        WriteLine("* По заданным g, n и m определить дату следующего дня. Заданный год       *");
        WriteLine("* является високосным.                                                    *");
        WriteLine("***************************************************************************");
        WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                         ");
        WriteLine("***************************************************************************");
        WriteLine("Введите значение переменной g: ");
        int x = Convert.ToInt32(ReadLine());
        WriteLine("Введите значение переменной m: ");
        int y = Convert.ToInt32(ReadLine());
        WriteLine("Введите значение переменной n: ");
        int z = Convert.ToInt32(ReadLine());
        string res;
        if (((y < 1) || (y > 12)) && ((z < 1) || (z > 31))){
            res = "Введено неверное значение";
        }
        else if ((y==2) && (z > 29))
        {
            res = "В феврале всего 29 дней";
        }
        else
        {
            res = "Дата следующего дня: " + ds.FindDateOfNextDay(x, y, z);
        }



        WriteLine("***************************************************************************");
        WriteLine("* РЕЗУЛЬТАТ                                                               *");
        WriteLine("***************************************************************************");
        WriteLine(res);
        ReadLine();
    }
}