using Tyuiu.SologubNV.Sprint2.Task3.V30.Lib;
using static System.Console;
class Program
{
    static void Main(string[] args)
    {
        DataService ds = new DataService();
        Title = "Спринт #2 | Выполнил: Сологуб Н.В | ИБКСб-26-1";
        WriteLine("***************************************************************************");
        WriteLine("* Спринт #2                                                               *");
        WriteLine("* Тема: Создание Итогового решения по спринту                             *");
        WriteLine("* Задание #3                                                              *");
        WriteLine("* Вариант #30                                                             *");
        WriteLine("* Выполнил: Сологуб Николай Витальевич | ИБКСб-26-1                       *");
        WriteLine("***************************************************************************");
        WriteLine("* УСЛОВИЕ;                                                                *");
        WriteLine("* Написать программу, которая вычисляет требуемое значение функции Y с    *");
        WriteLine("* использованием вложенных оператор if-else, где пользователь вводит      *");
        WriteLine("* значение переменной X с клавиатуры.                                     *");
        WriteLine("* Округлить полученное значение до трех знаков после запятой;             *");
        WriteLine("***************************************************************************");
        WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                         ");
        WriteLine("***************************************************************************");
        WriteLine("Введите значение переменной X: ");
        double x = Convert.ToDouble(ReadLine());
        double res = ds.Calculate(x);


        WriteLine("***************************************************************************");
        WriteLine("* РЕЗУЛЬТАТ                                                               *");
        WriteLine("***************************************************************************");
        WriteLine("Значение функции = " + res);
        ReadLine();
    }
}